Revit 2027 API
IndexBuffer.GetIndexStreamPoint Method
 Gets a stream that can be used to write IndexPoint primitives into the buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IndexStreamPoint GetIndexStreamPoint()
Public Function GetIndexStreamPoint As IndexStreamPoint
public:
IndexStreamPoint^ GetIndexStreamPoint()
member GetIndexStreamPoint : unit -> IndexStreamPoint
Return Value
IndexStreamPoint
 The stream that can be used to write into this buffer.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space.
See Also
Reference
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace